*** Exporting with replacements of description list tags
<<exporting-dlists>>
Execute export with "special formatting" with
: (org-export-to-file 'ELOT-latex "ELOT.tex")

#+name: defun-ELOT-latex-derived-backend
#+begin_src emacs-lisp
    ;; see https://emacs.stackexchange.com/questions/55231/org-mode-export-html-add-name-attirbute-to-checkbox-input
    (org-export-define-derived-backend 'ELOT-latex 'latex
      :translate-alist '((item . my-item-translator)))
    (defvar item-process nil)

    (defun my-item-translator (item c info)
      (let* ((item-tag-maybe (car (org-element-property :tag item)))
             (item-tag-stringp (stringp item-tag-maybe))
             (item-tag (if item-tag-stringp (substring-no-properties item-tag-maybe) item-tag-maybe)))
        (if (and item-tag-stringp (string= item-tag "item-translate-start")) (setq item-process t))
        (if (and item-tag-stringp (string= item-tag "item-translate-stop")) (setq item-process nil))
      (when (and item-process item-tag-stringp)
        (progn
          ;(message (substring-no-properties item-tag))
          (setf (plist-get (cadr item) :checkbox) nil)  ; set checkbox here
          (let ((tag-mapped (assoc item-tag (quote
  (("iof-av:isPrimitive" . "primitive?")
   ("iof-av:naturalLanguageDefinition" . "definition")
   ("iof-av:primitiveRationale" . "why primitive")
   ("iof-av:usageNote" . "usage note")
   ("owl:deprecated" . "deprecated?")
   ("rdfs:seeAlso" . "see also")
   ("skos:example" . "example")
   ("skos:scopeNote" . "scope note")
   ("skos:altLabel" . "alternative label")
   ("iof-av:explanatoryNote" . "explanatory note")
   ("rdfs:comment" . "comment")
   ("rdfs:isDefinedBy" . "defined by")
   ("iof-av:firstOrderLogicDefinition" . "first-order logic definition")
   ("iof‑av:semiFormalNaturalLanguageDefinition" . "semi-formal definition")
   ("iof-av:semiFormalNaturalLanguageAxiom" . "semi-formal axiom")
   ("iof-av:adaptedFrom" . "adapted from")
   ("iof-av:synonym" . "synonym"))
                                           ))))
              (if tag-mapped
                  (setf (plist-get (cadr item) :tag) (cdr tag-mapped)))
              )))
      (unless (and item-tag-stringp
                   (or (string= item-tag "item-translate-start") (string= item-tag "item-translate-stop")))
        (org-latex-item item c info))))
#+end_src

#+RESULTS: defun-ELOT-latex-derived-backend
: my-item-translator

#+name: item-tag-name-map
| annotation property                        | entry text                   |
|--------------------------------------------+------------------------------|
| iof-av:isPrimitive                         | primitive?                   |
| iof-av:naturalLanguageDefinition           | definition                   |
| iof-av:primitiveRationale                  | why primitive                |
| iof-av:usageNote                           | usage note                   |
| owl:deprecated                             | deprecated?                  |
| rdfs:seeAlso                               | see also                     |
| skos:example                               | example                      |
| skos:scopeNote                             | scope note                   |
| skos:altLabel                              | alternative label            |
| iof-av:explanatoryNote                     | explanatory note             |
| rdfs:comment                               | comment                      |
| rdfs:isDefinedBy                           | defined by                   |
| iof-av:firstOrderLogicDefinition           | first-order logic definition |
| iof‑av:semiFormalNaturalLanguageDefinition | semi-formal definition       |
| iof-av:semiFormalNaturalLanguageAxiom      | semi-formal axiom            |
| iof-av:adaptedFrom                         | adapted from                 |
| iof-av:synonym                             | synonym                      |

#+begin_src emacs-lisp :var tagmap=item-tag-name-map :results code :tangle no :wrap "src emacs-lisp :tangle no"
(mapcar (lambda (x) (cons (car x) (cadr x))) tagmap)
#+end_src

#+RESULTS:
#+begin_src emacs-lisp :tangle no
(("iof-av:isPrimitive" . "primitive?")
 ("iof-av:naturalLanguageDefinition" . "definition")
 ("iof-av:primitiveRationale" . "why primitive")
 ("iof-av:usageNote" . "usage note")
 ("owl:deprecated" . "deprecated?")
 ("rdfs:seeAlso" . "see also")
 ("skos:example" . "example")
 ("skos:scopeNote" . "scope note")
 ("skos:altLabel" . "alternative label")
 ("iof-av:explanatoryNote" . "explanatory note")
 ("rdfs:comment" . "comment")
 ("rdfs:isDefinedBy" . "defined by")
 ("iof-av:firstOrderLogicDefinition" . "first-order logic definition")
 ("iof‑av:semiFormalNaturalLanguageDefinition" . "semi-formal definition")
 ("iof-av:semiFormalNaturalLanguageAxiom" . "semi-formal axiom")
 ("iof-av:adaptedFrom" . "adapted from")
 ("iof-av:synonym" . "synonym"))
#+end_src

To to find the positions where we start and end the tag
replacements. /But/, this isn't usable, because the tangled ontology
content influences position numbers /at export/.
#+begin_src emacs-lisp :tangle no
  (save-excursion
    (beginning-of-buffer)
    (search-forward-regexp "* IDO Entities")
    (let* ((entry (org-element-at-point))
           (start (org-element-property :begin entry))
           (end (org-element-property :end entry)))
      (cons start end)))
#+end_src

#+RESULTS:
: (35634 . 204383)

